//==================================================================================
//
// プロジェクトのコンポーネントのヘッダーファイル [MyComponent.h]
//
//==================================================================================
#pragma once

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "Engine.h"

// Y 軸で回り続けるコンポーネント
class Spin final : public dxs::Component {
public:
    void Update(dxs::Entity& entity, float fDeltaSeconds) override;
};
