//==================================================================================
//
// テスト用のコンポーネントのヘッダーファイル [TestComponent.h]
//
//==================================================================================
#pragma once
//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "Engine.h"

class TestComponent final : public dxs::Component {
public:
    void Update(dxs::Entity& entity, float fDeltaSeconds) override;
};
